{
  "categories": [
    {
      "id": "football-games",
      "name": "Football Games",
      "slug": "football-games",
      "description": "Dive into the world's most popular sport with our exciting collection of football games featuring realistic physics, strategic gameplay, and competitive action for all skill levels.",
      "longDescription": "Experience the beautiful game like never before with our comprehensive collection of football games that capture the essence of soccer through innovative gameplay mechanics and engaging features. From intense penalty shootouts and fast-paced arcade matches to strategic team management and physics-based gameplay, these games offer diverse experiences for every football enthusiast. Whether you're perfecting your free kicks, managing a championship team, or enjoying casual matches with friends, our football games deliver authentic sporting excitement. Each game features intuitive controls, stunning graphics, and competitive multiplayer action that brings the thrill of the pitch directly to your browser. Perfect for quick gaming sessions or extended tournaments, these games combine accessibility with depth to create memorable football experiences.",
      "isTopLevel": true,
      "gameCount": 5
    },
    {
      "id": "basketball-games",
      "name": "Basketball Games",
      "slug": "basketball-games",
      "description": "Step onto the virtual court with our premium basketball games collection, featuring precision shooting mechanics, competitive tournaments, and skill-based challenges.",
      "longDescription": "Master the art of basketball with our exceptional collection of games that bring the fast-paced excitement of the court directly to your screen. From simple shooting challenges and free-throw competitions to complex multiplayer tournaments and full-court action, these games offer a complete basketball experience for players of all skill levels. Perfect your shooting technique, master advanced dribbling moves, and compete against players worldwide while enjoying realistic physics and responsive controls. Each game features progressive difficulty systems, unlockable content, and various game modes including career challenges, quick matches, and championship tournaments. Whether you're practicing your three-point shots or leading your team to victory, our basketball games provide the perfect combination of accessibility and competitive depth that keeps you coming back for more.",
      "isTopLevel": true,
      "gameCount": 3
    },
    {
      "id": "baseball-games",
      "name": "Baseball Games",
      "slug": "baseball-games",
      "description": "Step onto the virtual court with our premium basketball games collection, featuring precision shooting mechanics, competitive tournaments, and skill-based challenges.",
      "longDescription": "Master the art of basketball with our exceptional collection of games that bring the fast-paced excitement of the court directly to your screen. From simple shooting challenges and free-throw competitions to complex multiplayer tournaments and full-court action, these games offer a complete basketball experience for players of all skill levels. Perfect your shooting technique, master advanced dribbling moves, and compete against players worldwide while enjoying realistic physics and responsive controls. Each game features progressive difficulty systems, unlockable content, and various game modes including career challenges, quick matches, and championship tournaments. Whether you're practicing your three-point shots or leading your team to victory, our basketball games provide the perfect combination of accessibility and competitive depth that keeps you coming back for more.",
      "isTopLevel": true,
      "gameCount": 3
    }
  ]
} 